vanbuong/wunderbar-master-node/apps/mcux_freertos_blinky/board/pin_mux.h
/*
 * Copyright 2026
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "fsl_common.h"

#define BOARD_LED_GPIO     GPIOA
#define BOARD_LED_GPIO_PIN 29U

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PIN_MUX_H_ */
